//--------------------------------------------------------------------------------------
// Файл: urok2.fx
// Copyright (c) Microsoft Corporation. Все права защищены.
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
// Вершинный шейдер
//--------------------------------------------------------------------------------------
float4 VS( float4 Pos : POSITION ) : SV_POSITION
{
	// Оставляем координаты точки без изменений
    //Pos.x *= 0.5;
    return Pos;
}


//--------------------------------------------------------------------------------------
// Пиксельный шейдер
//--------------------------------------------------------------------------------------
float4 PS( float4 Pos : SV_POSITION ) : SV_Target
{
	// Возвращаем желтый цвет, непрозрачный (альфа == 1, альфа-канал не включен).	
    return float4( 1.0f, 1.0f, 0.0f, 1.0f );
}
